# EndPoly

## Description
Procedure EndPoly completes the definition of a polygon or polyline object within a VectorWorks document. On calling EndPoly, the object is created in the document from the preceding vertex creation calls.

```pascal
PROCEDURE EndPoly;
```

```python
def vs.EndPoly():
    return None
```

## See Also
<listTable indent="1" cols="4">
AddPoint|AddPoint
ArcTo|ArcTo
BeginPoly|BeginPoly
ClosePoly|ClosePoly
CurveThrough|CurveThrough
CurveTo|CurveTo
DelVertex|DelVertex
EndPoly|EndPoly
GetHole|GetHole
GetNumHoles|GetNumHoles
GetPolylineVertex|GetPolylineVertex
GetPolyPt|GetPolyPt
GetVertexVisibility|GetVertexVisibility
GetVertNum|GetVertNum
InsertVertex|InsertVertex
OpenPoly|OpenPoly
Poly|Poly
SetPolylineVertex|SetPolylineVertex
SetPolyPt|SetPolyPt
SetVertexVisibility|SetVertexVisibility
Smooth|Smooth
</listTable>

## Version
Availability: from All Versions

## Category
* Objects - Polys